app/views/users/show.html.erb

  <h2>投稿一覧</h2>
  <% @user.meanings.order(created_at: :desc).each do |t| %>
---
SELECT `meanings`.* FROM `meanings` WHERE `meanings`.`user_id` = 1 ORDER BY `meanings`.`created_at` DESC