app/views/words/show.html.erb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1  [["id", 1], ["LIMIT", 1]]
---
            <div class="item meaning-item">
                <p class="user-name"><%= c.user.name unless c.user.blank? %></p>