app/views/words/show2.html.erb

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
        <div>
            <%= c.user.name unless c.user.blank? %>