app/controllers/likes_controller.rb

INSERT INTO `likes` (`meaning_id`, `user_id`, `created_at`, `updated_at`) VALUES (4, 1, '2021-01-07 11:34:20.959288', '2021-01-07 11:34:20.959288')
---
    def create
        like = current_user.likes.create(meaning_id: params[:meaning_id])

SELECT `likes`.* FROM `likes` WHERE `likes`.`meaning_id` = 4 AND `likes`.`user_id` = 1 LIMIT 1
DELETE FROM `likes` WHERE `likes`.`id` = 1
---
    def destroy
        like = Like.find_by(meaning_id: params[:meaning_id], user_id: current_user.id)
        like.destroy