app/controllers/meanings_controller.rb

SELECT `words`.* FROM `words` WHERE `words`.`id` = 4 LIMIT 1
INSERT INTO `meanings` (`meaning`, `created_at`, `updated_at`, `user_id`, `word_id`) VALUES ('', '2021-01-06 14:16:18.044096', '2021-01-06 14:16:18.044096', 1, 4)
---
    def create
        word = Word.find(params[:word_id])
        meaning = word.meanings.build(meaning_params)
        meaning.user_id = current_user.id
        if meaning.save

SELECT `words`.* FROM `words` WHERE `words`.`id` = 4 LIMIT 1
SELECT `meanings`.* FROM `meanings` WHERE `meanings`.`id` = 4 LIMIT 1
---
    def edit
        @word = Word.find(params[:word_id])
        @meaning = Meaning.find(params[:id])

SELECT `meanings`.* FROM `meanings` WHERE `meanings`.`id` = 4 LIMIT 1
UPDATE `meanings` SET `meanings`.`meaning` = '食べているとき！', `meanings`.`updated_at` = '2021-01-09 14:37:16.545816' WHERE `meanings`.`id` = 4
---
    def update
        meaning = Meaning.find(params[:id])
        if meaning.update(meaning_params)

SELECT `meanings`.* FROM `meanings` WHERE `meanings`.`id` = 4 LIMIT 1
DELETE FROM `meanings` WHERE `meanings`.`id` = 4
---
    def destroy
        meaning = Meaning.find(params[:id])
        meaning.destroy