app/controllers/words_controller.rb

SELECT COUNT(*) FROM `words`
SELECT `words`.* FROM `words`
---
    def index
        @words = Word.all.page(params[:page]).per(9)

INSERT INTO `words` (`word`, `meaning`, `furigana`, `created_at`, `updated_at`, `user_id`) VALUES ('幸せ', '満ち足りていること', 'しあわせ', '2021-01-06 12:10:46.102478', '2021-01-06 12:10:46.102478', 1)
---
    def create
        word = Word.new(word_params)
        word.user_id = current_user.id
        if word.save

SELECT `words`.* FROM `words` WHERE `words`.`id` = 3 LIMIT 1
SELECT COUNT(*) FROM `words`
SELECT `meanings`.* FROM `meanings` WHERE `meanings`.`word_id` = 7 ORDER BY `meanings`.`created_at` DESC
SELECT COUNT(*) FROM `likes` WHERE `likes`.`meaning_id` = 4
---
    def show
        @word = Word.find(params[:id])
        @meanings = @word.meanings.order(created_at: :desc).all.page(params[:page]).per(9)
        @meaning = Meaning.new
        #いいねランキング
        @rank_meanings = @word.meanings.sort {|a,b| b.liked_users.count <=> a.liked_users.count}

SELECT `words`.* FROM `words` WHERE `words`.`id` = 8 LIMIT 1
SELECT COUNT(*) FROM `likes` WHERE `likes`.`meaning_id` = 14
SELECT `meanings`.* FROM `meanings` WHERE `meanings`.`word_id` = 8
---
    def show2
        @word = Word.find(params[:id])
        @meanings = @word.meanings.order(created_at: :desc).all.page(params[:page]).per(9)
        @meaning = Meaning.new
        #いいねランキング
        @rank_meanings = @word.meanings.sort {|a,b| b.liked_users.count <=> a.liked_users.count}
        @rank_meanings = Kaminari.paginate_array(@rank_meanings).page(params[:page]).per(9)

SELECT `words`.* FROM `words` WHERE `words`.`id` = 10 LIMIT 1
---
    def edit
        @word = Word.find(params[:id])

SELECT `words`.* FROM `words` WHERE `words`.`id` = 10 LIMIT 1
UPDATE `words` SET `words`.`meaning` = 'その人にとって望ましいこと。不満がないこと。また、そのさま。幸福。幸い。', `words`.`updated_at` = '2021-02-10 14:24:12.819243' WHERE `words`.`id` = 7
---
    def update
        word = Word.find(params[:id])
        if word.update(word_params)

SELECT `words`.* FROM `words` WHERE `words`.`id` = 14 LIMIT 1
DELETE FROM `words` WHERE `words`.`id` = 14
---
    def destroy
        word = Word.find(params[:id])
        word.destroy