app/models/user.rb

SELECT 1 AS one FROM `likes` WHERE `likes`.`user_id` = 1 AND `likes`.`meaning_id` IS NULL LIMIT 1
---
  def already_liked?(meaning)
    self.likes.exists?(meaning_id: meaning.id)